Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
import pandas as pd

data = [4,8,15,16,23,42]

pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [12]:
list = [1,2,3,4,5,'ryaz',7,True,0.21,10]

pd.Series(list)

0       1
1       2
2       3
3       4
4       5
5    ryaz
6       7
7    True
8    0.21
9      10
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [17]:
name = pd.Series(['Alise','Bob','Clarie'])
age = pd.Series([25,30,27])
gender = pd.Series(['female','male','female'])

In [19]:
data = {'Name':name,
       ' Age':age,
        'Gender':gender}

In [20]:
pd.DataFrame(data)

     Name   Age  Gender
0   Alise    25  female
1     Bob    30    male
2  Clarie    27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame : Two dimensional structured with rows and columns whose size can be change

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

head/
tail/
described/
shape

In [22]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

:both Series and DataFrame are mutable in nature, while Panel is not.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [33]:
fruits_name = pd.Series(['apple','Banana','Charry'])
price = pd.Series([25,30,27])
Veg_frt= pd.Series(['fruit','fruit','fruit'])

list = {'Name':fruits_name,
       'Price':price,
        'vegORfrt':Veg_frt}

In [34]:
pd.DataFrame(list)

     Name  Price vegORfrt
0   apple     25    fruit
1  Banana     30    fruit
2  Charry     27    fruit